task = '''
Определите компоненты сильной связности для заданного графа
Выведите топологически отсортированные компоненты сильной связности
для этого графа.

Тестовое покрытие для этой задачи реализовать сложно. 
Тут будет проверка вручную.
'''


def printGraphC(fin):
    lines = []
    pass
    return lines


def main():
    f = open("dataC.txt")
    lines = printGraphC(f)
    for line in lines:
        print(line)


# Для ручной проверки нажмите Ctrl+Shift+F10
# установив курсор на  main
# или создайте конфигурацию Run-Edit configuration
if __name__ == "__main__":
    main()
